#include <iostream> // директива потокового вводу-виводу даних
#include <Windows.h> // директива для можоивості використання кирилиці в консолі
#include <string>  // директива препроцесора для зручної роботи зі строками
#include "Structs.h" // директива підключення .h-файлу з описом структур
#include "ProtFunc.h" // директива підключення .h-файлу з заголовками функцій
#include "RFunc.h" // директива підключення .h-файлу з реалізацєю функцій

using namespace std;  // використання імен std

int main()
{
	SetConsoleCP(1251); // кирилиця в консолі
	SetConsoleOutputCP(1251); //теж
	int size = 20;  // фіксація розміру масиву в змінній
	Avia* List = new Avia[size];  // оголошення масиву структур з 20 елементів (за умовою)
	int atList = 0; // змінна для індексації масивом компаній
	List[atList++] = { 0,"Пасажирський",9,40 };
	List[atList++] = { 1,"Грузовий",11,55 };
	List[atList++] = { 2,"Винищувач",2,10 };
	/*                  Номер,Тип,Години,Хвилини                     */
	Menu(List, size, atList); // виклик основної виконавчої функції
	return 0;
}